# <span style="color: pink;"> DATA WRANGLING </span>

## <span style="color: #C8A2C8;"> Import Data </span>

## <span style="color: #C8A2C8;"> Package Import </span>

In [1]:
import numpy as np 
import pandas as pd

## <span style="color: #C8A2C8;"> Numpy </span>
- Lists are viewed as arrays in numpy giving them extra functionality and more efficient
- Linear algebra package built for the most basic way for all computers making it very efficient
- Originally written in C and it is now expressed as python functions
- With arrays we can do vectorized operations

In [14]:
# Import CSV file in url as a pandas dataframe object assigned to the variable df 
df = pd.read_csv('PUBH1142Chap0801.csv')

In [ ]:
#Get rows 0-4
df.head()

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [16]:
# Show the Age column
df['Age']

0      43
1      53
2      33
3      43
4      46
       ..
195    66
196    54
197    61
198    65
199    66
Name: Age, Length: 200, dtype: int64

In [ ]:
#Another way to get a column
df.Age

0      43
1      53
2      33
3      43
4      46
       ..
195    66
196    54
197    61
198    65
199    66
Name: Age, Length: 200, dtype: int64

## <span style="color: #C8A2C8;"> iloc and loc </span>

### iloc
- df.iloc[ ]
- it is a locator
- if it is only one value in [] you are only referencing rows, if you have two then it is row, column
- can use the range function [#:#]

### loc
- can give names of columns when you don't know the number

In [19]:
df.iloc[0]

Name                   Dylan Patton
DOB                      1981-10-07
Age                              43
Vocation             Energy manager
Smoke                             0
HR                               47
sBP                             145
CholesterolBefore               1.2
TAG                             1.2
Survey                            1
CholesterolAfter                0.7
Delta                           0.5
Group                        Active
Name: 0, dtype: object

In [20]:
df.iloc[0:5]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [21]:
df.iloc[0:5, 0:2]

                Name         DOB
0       Dylan Patton  1981-10-07
1      Sandra Howard  1993-01-27
2  Samantha Williams  1973-12-21
3     Ashley Hensley  1981-12-01
4      Robert Wilson  1964-06-23

In [22]:
df.loc[0:5, ['Name', 'Age']]

                Name  Age
0       Dylan Patton   43
1      Sandra Howard   53
2  Samantha Williams   33
3     Ashley Hensley   43
4      Robert Wilson   46
5        Leslie Diaz   48

In [23]:
age = df.Age

In [25]:
type(age)

pandas.core.series.Series

In [27]:
age = df.Age.to_numpy()
age

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 38, 35,
       50, 45, 49, 63, 45, 51, 43, 31, 58, 40, 47, 45, 41, 47, 38, 54, 30,
       46, 64, 41, 40, 45, 65, 74, 55, 58, 53, 68, 54, 72, 32, 38, 59, 53,
       69, 42, 67, 38, 51, 37, 36, 34, 38, 31, 48, 49, 62, 39, 74, 41, 42,
       60, 67, 42, 74, 52, 37, 61, 54, 72, 36, 49, 47, 49, 49, 69, 43, 38,
       60, 45, 71, 65, 73, 60, 70, 45, 49, 65, 53, 30, 58, 50, 69, 72, 61,
       33, 30, 44, 71, 49, 75, 43, 35, 55, 38, 36, 46, 60, 40, 57, 69, 56,
       66, 60, 42, 49, 68, 32, 31, 56, 35, 63, 54, 68, 72, 40, 41, 66, 73,
       36, 54, 57, 74, 48, 72, 54, 71, 42, 54, 66, 58, 60, 63, 44, 55, 73,
       55, 40, 43, 71, 54, 61, 55, 67, 55, 68, 71, 54, 42, 53, 69, 57, 45,
       62, 33, 74, 74, 64, 43, 35, 57, 64, 55, 74, 50, 40, 62, 65, 63, 68,
       45, 41, 54, 62, 65, 72, 61, 70, 66, 54, 61, 65, 66])

In [28]:
age.mean()

np.float64(53.07)

Can change a series object to a numpy array by doing .to_numpy()

In [29]:
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [30]:
vocations = df.Vocation

In [31]:
# Tell me the unique elements in the vocations
vocations.unique()

array(['Energy manager', 'Tax adviser', 'IT consultant',
       "Nurse, children's", 'Clinical embryologist',
       "Politician's assistant", 'Police officer',
       'Scientific laboratory technician', 'Lexicographer',
       'Charity fundraiser', 'Chief Marketing Officer', 'Hydrologist',
       'Advertising account planner', 'Web designer', 'Lobbyist',
       'Photographer', 'Chartered loss adjuster',
       'Community education officer', 'Occupational hygienist',
       'Conservation officer, nature', 'Chemist, analytical',
       'Immunologist', 'Exhibition designer', 'Special effects artist',
       'Broadcast presenter', 'Psychologist, occupational', 'Midwife',
       'Meteorologist', 'Sports therapist', 'Therapist, horticultural',
       'Mining engineer', 'Estate agent', 'Waste management officer',
       'Tourist information centre manager', 'Lecturer, higher education',
       'Research scientist (physical sciences)', 'Technical brewer',
       'Minerals surveyor', 'Commercial/residential surveyor',
       'Lecturer, further education', 'Programmer, systems',
       'Insurance claims handler', 'Media planner',
       'Magazine features editor', 'Research scientist (medical)',
       'Arts administrator', 'Museum/gallery exhibitions officer',
       'Scientist, research (physical sciences)', 'Journalist, magazine',
       'Professor Emeritus', 'Buyer, industrial', 'Journalist, newspaper',
       'Ergonomist', 'Estate manager/land agent',
       'Logistics and distribution manager', 'Scientist, audiological',
       'Counselling psychologist', 'Pharmacist, community',
       'Aeronautical engineer', 'Advertising copywriter',
       'Landscape architect', 'Psychologist, sport and exercise',
       'Surveyor, hydrographic', 'Secretary, company',
       'Financial controller', 'Teacher, secondary school', 'Cabin crew',
       'Cartographer', 'Passenger transport manager', 'Graphic designer',
       'Brewing technologist', 'Industrial buyer', 'Designer, textile',
       'Nature conservation officer', 'Set designer',
       'Information officer', 'Product designer', 'Contractor',
       'Nurse, learning disability', 'Insurance broker',
       'Hydrographic surveyor', 'Corporate investment banker',
       'Bookseller', 'Lawyer', 'Surveyor, mining', 'Engineer, mining',
       'Dealer', 'Psychotherapist, child', 'Computer games developer',
       'Paramedic', 'Clinical biochemist', 'Forensic psychologist',
       'Communications engineer', 'Herpetologist',
       'Engineer, manufacturing', 'Agricultural consultant',
       'Engineer, energy', 'Community pharmacist', 'Music tutor',
       'Trading standards officer', 'Statistician',
       'Manufacturing systems engineer', 'Call centre manager',
       'Control and instrumentation engineer',
       'Medical sales representative', 'Trade union research officer',
       'Trade mark attorney', 'Publishing copy', 'Mental health nurse',
       'Maintenance engineer', 'Translator', 'Volunteer coordinator',
       'Secretary/administrator', 'Museum/gallery conservator',
       'Biomedical scientist', 'Medical illustrator',
       'Geophysicist/field seismologist', 'Corporate treasurer',
       'Fish farm manager', 'Dancer', 'Heritage manager',
       'Legal executive', 'Energy engineer', 'Musician',
       'Careers information officer', 'Careers adviser', 'Oncologist',
       'Video editor', 'Engineering geologist',
       'Surveyor, building control', 'Cytogeneticist',
       'Accommodation manager', 'Public house manager',
       'Production manager', 'Bonds trader', 'Electrical engineer',
       'Media buyer', 'English as a foreign language teacher',
       'Horticultural consultant', 'Accountant, chartered certified',
       'Archivist', 'Development worker, international aid',
       'Animal technologist', 'Engineer, civil (contracting)',
       'Newspaper journalist', 'Engineer, electronics',
       'Administrator, sports', 'Journalist, broadcasting',
       'Radiation protection practitioner', 'Private music teacher',
       'Adult guidance worker', 'Scientist, marine', 'Furniture designer',
       'Operational investment banker', 'Therapeutic radiographer',
       'Building control surveyor', 'Occupational therapist',
       'Personnel officer', 'Fashion designer',
       'Surveyor, planning and development',
       'Engineer, control and instrumentation', 'Solicitor, Scotland',
       'Dramatherapist', 'Advertising account executive',
       'Sport and exercise psychologist',
       'Senior tax professional/tax inspector',
       'Psychologist, educational', 'Designer, television/film set',
       'Geneticist, molecular', 'Sales professional, IT',
       'Chartered certified accountant', 'Theme park manager'],
      dtype=object)

# Quiz questions

# 📌 **Pandas Basics Cheat Sheet**

## 🐍 **1. Importing Pandas**
```python
import pandas as pd
```

## 📂 **2. Reading a CSV File into a DataFrame**
```python
df = pd.read_csv("data.csv")
```

## 👀 **3. Displaying the First 5 Rows**
```python
df.head()
```

## 📏 **4. Getting the Number of Rows and Columns**
```python
df.shape  # Returns (rows, columns)
```

## 🏷 **5. Printing All Column Names**
```python
df.columns
```

## ℹ️ **6. Summary Information of the DataFrame**
```python
df.info()
```

## 🔍 **7. Selecting Rows Where Column A > 5**
```python
df[df["A"] > 5]
```

## 🎯 **8. Selecting Specific Columns (A and B)**
```python
df[["A", "B"]]
```

## ✏️ **9. Renaming a Column A to Alpha**
```python
df.rename(columns={"A": "Alpha"}, inplace=True)
```

## 🔄 **10. Replacing All Occurrences of 999 with NaN**
```python
import numpy as np
df.replace(999, np.nan, inplace=True)
```

## 🗑 **11. Dropping Rows with Missing Values**
```python
df.dropna(inplace=True)
```

## 🛠 **12. Filling Missing Values with 0**
```python
df.fillna(0, inplace=True)
```

## 📊 **13. Calculating the Mean of Column A**
```python
df["A"].mean()
```

## ➕ **14. Creating a New Column C as the Sum of A and B**
```python
df["C"] = df["A"] + df["B"]
```

## 💾 **15. Saving the DataFrame to a CSV File**
```python
df.to_csv("output.csv", index=False)

![Good Work](https://media.giphy.com/media/3o7abKhOpu0NwenH3O/giphy.gif)

### Time to put this info to work!